1. Importa le librerie necessarie

In [2]:
import pandas as pd

2. Importa il dataframe da questo [link](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user", sep = "|")
df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

3. Seleziona solo la colonna age

In [4]:
df[["age"]]

     age
0     24
1     53
2     23
3     24
4     33
..   ...
938   26
939   32
940   20
941   48
942   22

[943 rows x 1 columns]

4. Crea un dataframe chiamato worker con solo le colonne age e occupation e visualizzale

In [5]:
worker = df[["age","occupation"]]
worker

     age     occupation
0     24     technician
1     53          other
2     23         writer
3     24     technician
4     33          other
..   ...            ...
938   26        student
939   32  administrator
940   20        student
941   48      librarian
942   22        student

[943 rows x 2 columns]

5. Calcola l' età media

In [6]:
df["age"].mean()

34.05196182396607

6. Filtra gli users con età maggiori di 50

In [7]:
worker = df[df["age"] > 50]
worker

     user_id  age gender     occupation zip_code
1          2   53      F          other    94043
6          7   57      M  administrator    91344
9         10   53      M         lawyer    90703
46        47   53      M      marketing    07102
64        65   51      F       educator    48118
..       ...  ...    ...            ...      ...
899      900   60      M        retired    18505
911      912   51      M          other    06512
930      931   60      M       educator    33556
931      932   58      M       educator    06437
933      934   61      M       engineer    22902

[105 rows x 5 columns]

7. Seleziona le occupazioni che iniziano con la 'a'

AttributeError: ignored

8. Seleziona le prime 7 righe del dataframe

In [8]:
df.head(7)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344

9. Presenta solo le occupazione degli users di 23-24 anni

In [10]:
df[(df["age"] >=23)&(df.age <= 24)] [["occupation","age"]]

     occupation  age
0    technician   24
2        writer   23
3    technician   24
30       artist   24
32      student   23
..          ...  ...
874     student   24
888  technician   24
897   homemaker   23
926  programmer   23
935       other   24

[61 rows x 2 columns]